content-org/posts/bibliography.org
#+title:      Bibliography
#+date:       <2024-04-07 sø.>
#+OPTIONS: author:nil
#+STARTUP: inlineimages

#+bibliography: ~/Dokumenter/biblio/SICL-compiler.bib
#+cite_export: basic

#+hugo_base_dir: ~/Dokumenter/sicl-hugo
#+hugo_selection: posts
#+hugo_front_matter_format: yaml

